Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་དེ་དག་གིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་འདྲི་བ་དང་། ཀློག་པ་དང་ལུང་འབོག་པ་དང་། ཁ་ཏོན་བྱ་བ་དང་། བསྟན་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱ་བའི་ཕྱིར་དགོངས་པ་མཛད་དོ།
en: All those lord buddhas of the ten directions who are alive at present also direct their enlightened intention toward noble sons and noble daughters who commit this profound perfection of wisdom to writing, reciting, disseminating, teaching, and focusing their attention correctly on it.

source: །ཕྱོགས་བཅུའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕྱིར་མི་ལྡོག་པ་གང་ཇི་སྙེད་པ་དེ་དག་ཀྱང་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་འདྲི་ཞིང་ཀློག་པ་དང་། ལུང་འབོག་པ་དང་ཁ་ཏོན་བྱེད་པ་དང་སྟོན་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པ་དེ་དག་གི་དོན་དུ་བརྩོན་པར་བྱེད་ཅིང་། ཡོངས་སུ་འཛིན་པར་བྱེད་དོ།། །།ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ། བམ་པོ་བཞི་བཅུ་ལྔ་པ།
en: All those bodhisattva great beings of the ten directions who are irreversible also accept and make efforts on behalf of noble sons and noble daughters who commit this profound perfection of wisdom to writing, reciting, transmitting, disseminating, teaching, and focusing their attention correctly on it. “

source: རབ་འབྱོར་འདི་ལྟ་སྟེ། དཔེར་ན། བུད་མེད་ལ་ལ་ཞིག་ལ། བུ་ལྔ་འམ། བཅུ་འམ། ཉི་ཤུ་འམ། སུམ་ཅུ་འམ།
en: Subhūti, it is just as if there were a woman with five children, or with ten, {Ki.

source: བཞི་བཅུ་འམ། ལྔ་བཅུ་འམ། བརྒྱ་འམ། སྟོང་ཞིག་ཡོད་ན། དེ་དག་ནི་མ་དེ་ཅི་ནས་ཀྱང་མི་ན་བར་བྱ་བའི་ཕྱིར་བརྩོན་པར་བྱེད་ཅིང་བདག་ཅག་གི་མ་འདི་ཇི་ལྟར་ན་ནད་མེད་པར་འགྱུར།
en: IV: 57} twenty, thirty, forty, fifty, one hundred, or one thousand children—they would strive by any means to ensure that their mother would not fall ill and they would attend to their mother with excellent acts of service, saying, ‘May this mother of ours by whatever means be free from ill health!

source: བདག་ཅག་གི་མ་འདི་ལ་ཇི་ལྟར་ན་བར་ཆད་དུ་མི་འགྱུར།
en: May this mother of ours by whatever means be without obstacles!

source: བདག་ཅག་གི་མ་འདི་ཇི་ལྟར་ན་ཡུན་རིང་དུ་འཚོ་བར་འགྱུར།
en: May this mother of ours by whatever means live a long life!

source: བདག་ཅག་གི་མ་འདི་རིང་དུ་འཚོ་བར་བྱེད་ན་ཇི་ལྟར་བྱ། བདག་ཅག་གི་མ་འདི་ལུས་ལ་མི་བདེ་བའི་ཉམས་མེད་པར་བྱ་ན་ཇི་ལྟར་བྱ།
en: May this mother of ours by whatever means be without feelings of physical discomfort!

source: འདི་ནི་བདག་ཅག་སྐྱེད་སྐྱེད་པ་སྟེ།
en: She is the one who has given birth to us!

source: སྲོག་གི་སྦྱིན་བདག་གོ།
en: She is the giver of life!’

source: །ཞེས་དེ་དག་མ་དེ་ལ་རིམ་གྲོ་ལེགས་པར་བྱ་བས་རིམ་གྲོ་བྱེད་དོ། །དེ་དག་ནི་འདིའི་སྲོག་གི་བར་ཆད་དུ་འགྱུར་དུ་འོང་ངོ་།
en: They would honor her with excellent honors, saying, ‘May her life be free from obstacles!

source: །ལུས་ཉམ་ཆུང་བར་འགྱུར་དུ་འོང་ངོ་།
en: May her body be free from frailty!

source: །ལུས་ལ་ཤ་སྦྲང་དང་། སྦྲང་བུ་དང་། སྦྲུལ་གྱིས་གཙེ་བའི་མི་བདེ་བས་བབ་དུ་འོང་ངོ་།
en: May her body not suffer the discomfort of being stung by mosquitoes, flies, or snakes!

source: །ཚ་བ་དང་། གྲང་བ་དང་། བཀྲེས་པ་དང་། སྐོམ་པས་མི་བདེ་བར་འགྱུར་དུ་འོང་ངོ་། །ཞེས་བསྟི་སྟང་ལེགས་པར་བྱ་བས་བསྟི་སྟང་དུ་བྱེད་དོ།
en: May she not suffer discomfort due to heat, cold, hunger, or thirst!’

source: །དེ་ལྟར་བུ་དེ་དག་མ་དེ་ལ་འདི་ནི་བདག་ཅག་སྐྱེད་སྐྱེད་པའོ། །འདི་ནི་འཇིག་རྟེན་འདི་སྟོན་པའོ། །ཞེས་བདེ་བའི་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་རྒྱུན་ཏུ་རིམ་གྲོ་བྱེད་ཅིང་བསྟི་སྟང་དང་བཀུར་བསྟི་ཆེར་བྱེད་དོ།
en: They would always serve, honor, and greatly venerate her, with all comforting amenities, saying, ‘She is the one who gave birth to us! She is the one who teaches us about this world!’

source: །རབ་འབྱོར་དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་རྟག་ཏུ་རྒྱུན་མི་ཆད་པར་གཟིགས་ཤིང་དགོངས་ཏེ། དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: In the same way, Subhūti, the tathāgatas, arhats, completely awakened buddhas also see and direct their enlightened intention uninterruptedly toward this profound perfection of wisdom with their buddha eye at all times.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་བདག་ཅག་གི་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་སྐྱེད་སྐྱེད་པའོ།
en: If you ask why, they always see and direct their enlightened intention toward this perfection of wisdom, saying, ‘She gives birth to all our buddha attributes.

source: །འཇིག་རྟེན་འདི་སྟོན་སྟོན་པའོ།
en: She reveals this world to us!’

source: །ཞེས་རྒྱུན་ཏུ་གཟིགས་ཤིང་དགོངས་སོ། །ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་གང་ཇི་སྙེད་ཅིག་བཞུགས་ཤིང་འཚོ་སྐྱོང་བ་དང་། ཆོས་སྟོན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་རྟག་ཏུ་རྒྱུན་མི་ཆད་པར་གཟིགས་ཤིང་དགོངས་སོ།
en: All the buddhas, too, the tathāgatas, arhats, completely awakened buddhas who are alive at present in all the realms of the ten directions, numerous as the grains of sand of the river Gaṅgā, and who are teaching the Dharma, also uninterruptedly see this profound perfection of wisdom at all times with their buddha eye and direct their enlightened intention toward her at all times.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་སྐྱེད་སྐྱེད་པའོ།
en: If you ask why, she is the one who gives birth to the tathāgatas, arhats, completely awakened buddhas.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཡེ་ཤེས་འདི་ཡང་སྟོན་སྟོན་པའོ།
en: She is the one who reveals this wisdom of all-aspect omniscience.

source: །དེ་བས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་རྟག་ཏུ་རྒྱུན་མི་ཆད་པར་གཟིགས་ཤིང་དགོངས་སོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལས་བྱུང་བ་ནི།
en: So it is that the tathāgatas, arhats, completely awakened buddhas uninterruptedly see this profound perfection of wisdom at all times with their buddha eye and direct their enlightened intention toward her at all times. “

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ།
en: If you ask why, there originate from her the perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity, which the tathāgatas, arhats, completely awakened buddhas have.

source: །འདི་ལས་བྱུང་བ་ནི་ནང་སྟོང་པ་ཉིད་དང་། ཕྱི་སྟོང་པ་ཉིད་དང་། ཕྱི་ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་རོ།
en: There originate from her the emptiness of internal phenomena, the emptiness of external phenomena, and [all the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities.

source: །འདི་ལས་བྱུང་བ་ནི་དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་དང་། ཡང་དག་པར་སྤོང་བ་བཞི་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དང་། དབང་པོ་ལྔ་དང་སྟོབས་ལྔ་དང་བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའོ།
en: There originate from her the four applications of mindfulness, the four correct exertions, the four supports for miraculous ability, the five faculties, the five powers, the seven branches of enlightenment, and the noble eightfold path.

source: །འདི་ལས་བྱུང་བ་ནི་འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དོ། །འདི་ལས་བྱུང་བ་ནི་མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་།
en: There originate from her the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, and the eight aspects of liberation.

source: སྨོན་པ་མེད་པ་དང་མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་རོ།
en: There originate from her the nine serial steps of meditative absorption, the gateways to liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, [great loving kindness], great compassion, the eighteen distinct qualities of the buddhas, and [all the goals], up to and including all-aspect omniscience.

source: །འདི་ལས་བྱུང་བ་ནི་རྒྱུན་དུ་ཞུགས་པ་རྣམས་དང་། ལན་ཅིག་ཕྱིར་འོང་བ་རྣམས་དང་ཕྱིར་མི་འོང་བ་རྣམས་དང་། དགྲ་བཅོམ་པ་རྣམས་དང་རང་སངས་རྒྱས་རྣམས་དང་།
en: There originate from her those who have entered the stream to nirvāṇa, those who are destined for only one more rebirth, those who are no longer subject to rebirth, arhats, pratyekabuddhas, and the tathāgatas, arhats, completely awakened buddhas. {

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དང་།
en: Ki.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཏེ། རབ་འབྱོར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གང་ཇི་སྙེད་ཅིག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དང་། མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་དང་། མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བ་དེ་དག་ཐམས་ཅད་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་རྟེན་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་དུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: IV: 58} “Subhūti, all the tathāgatas, arhats, completely awakened buddhas who have attained consummate buddhahood in unsurpassed, complete enlightenment, all those who will attain consummate buddhahood, and all those who are attaining consummate buddhahood, have attained consummate buddhahood in unsurpassed, complete enlightenment, will attain consummate buddhahood, and are attaining consummate buddhahood dependent on this profound perfection of wisdom.

source: །མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ། །མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ། །རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་འདྲི་ཞིང་ཀློག་པ་དང་ལུང་འབོག་པ་དང་ཁ་ཏོན་བྱེད་པ་དང་སྒོམ་པ་དང་ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས། སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་རྟག་ཏུ་རྒྱུན་མི་ཆད་པར་གཟིགས་ཤིང་དགོངས་སོ།
en: Subhūti, at all times the tathāgatas, arhats, completely awakened buddhas uninterruptedly see with their buddha eye and direct their enlightened intention toward all those noble sons and noble daughters who follow the vehicle of the bodhisattvas and who commit this profound perfection of wisdom to writing, reciting, transmitting, disseminating, cultivating, and focusing their attention correctly on it.

source: །རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་དེ་དག་ལ་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཅི་ནས་ཀྱང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཡོངས་སུ་ཉམས་པར་མི་འགྱུར་བར་རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་སྲུང་བ་མཛད་དོ། །རབ་འབྱོར་གྱིས་གསོལ་པ།
en: Subhūti, by all means and at all times the tathāgatas, arhats, completely awakened buddhas will uninterruptedly protect those noble sons and noble daughters who follow the vehicle of the bodhisattvas from lapsing from unsurpassed, complete enlightenment.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་གང་འདི་སྐད་དུ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་བསྐྱེད་པའོ། །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་འཇིག་རྟེན་སྟོན་པའོ། །ཞེས་བཀའ་སྩལ་པ།
en: Subhūti then said, “Blessed Lord, you have said that the perfection of wisdom gives birth to the tathāgatas, arhats, completely awakened buddhas and that the perfection of wisdom reveals the world.

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་བསྐྱེད་པ་ལགས།
en: Blessed Lord, how does the perfection of wisdom give birth to the tathāgatas, arhats, completely awakened buddhas?

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འཇིག་རྟེན་སྟོན་པ་ལགས།
en: Blessed Lord, how does the perfection of wisdom reveal the world?

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པས་དེ་བཞིན་གཤེགས་པ་བསྐྲུན་པ་ལགས།
en: Blessed Lord, how has the Tathāgata been given birth by the perfection of wisdom?

source: འཇིག་རྟེན་ནི་དེ་བཞིན་གཤེགས་པས་གང་ལ་གསུངས།
en: What is the world of which the Tathāgata speaks?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདིས་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་བསྐྱེད་དོ།
en: Subhūti,” replied the Blessed One, “this perfection of wisdom gives birth to the ten powers of the tathāgatas.

source: །མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་བསྐྱེད་དོ།
en: She gives birth to the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, the eighteen distinct qualities of the buddhas, and [all the goals], up to and including all-aspect omniscience.

source: །རབ་འབྱོར་ཆོས་དེ་དག་གིས་ནི་དེ་བཞིན་གཤེགས་པར་བརྗོད་དེ།
en: Subhūti, it is on the basis of these attributes that a tathāgata is designated.

source: རབ་འབྱོར་དེ་བས་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདིས་དེ་བཞིན་གཤེགས་པ་བསྐྱེད་དོ།
en: So it is, Subhūti, that this profound perfection of wisdom gives birth to the tathāgatas.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་འཇིག་རྟེན་གང་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, what is the world of which the tathāgatas speak?” “

source: རབ་འབྱོར་ཕུང་པོ་ལྔ་ནི་དེ་བཞིན་གཤེགས་པས་འཇིག་རྟེན་དུ་གསུངས་སོ།
en: Subhūti, the five psycho-physical aggregates are the world of which the tathāgatas speak,” replied the Blessed One. “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོས་ཕུང་པོ་ལྔ་ནི་ཇི་ལྟར་བསྟན་པ་ལགས།
en: Blessed Lord, how are the five psycho-physical aggregates revealed by the profound perfection of wisdom?

source: བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་ཇི་ལྟར་ཕུང་པོ་ལྔ་སྟོན་པ་ལགས།
en: Blessed Lord, how does the perfection of wisdom reveal the five psycho-physical aggregates?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་ཕུང་པོ་ལྔ་པོ་འདི་དག་འཇིག་པར་སྟོན་པ་མ་ཡིན།
en: The Blessed One replied, “The perfection of wisdom does not reveal that these five psycho-physical aggregates are perishable.

source: རབ་ཏུ་འཇིག་པར་སྟོན་པ་མ་ཡིན་ཏེ།
en: She does not reveal that they are very perishable.

source: སྐྱེ་ཞེས་བྱ་བར་མི་སྟོན་ཏོ། འགག་ཅེས་བྱ་བར་མི་སྟོན་ཏོ། །ཀུན་ནས་ཉོན་མོངས་ཞེས་བྱ་བ་དང་། རྣམ་པར་བྱང་ཞེས་བྱ་བ་དང་།
en: She does not reveal that they arise. {

source: འཕེལ་ཞེས་བྱ་བ་དང་།
en: Ki.

source: འགྲིབ་ཅེས་བྱ་བ་དང་།
en: IV: 59} She does not reveal that they cease.

source: བླང་ཞེས་བྱ་བ་དང་། དོར་ཞེས་བྱ་བ་དང་། འདས་ཞེས་བྱ་བ་དང་། མ་འོངས་ཤེས་བྱ་བ་དང་། ད་ལྟར་བྱུང་ཞེས་བྱ་བར་མི་སྟོན་ཏོ།
en: She does not reveal that they are afflicted, that they are purified, that they increase, that they decrease, that they are accepted, that they are rejected, that they are past, that they are future, or that they are present.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། སྟོང་པ་ཉིད་ལ་འཇིག་པའམ། རབ་ཏུ་འཇིག་པ་མེད་དོ།
en: If you ask why, emptiness is not perishable, or very perishable.

source: །མཚན་མ་མེད་པ་ལ་འཇིག་པའམ། རབ་ཏུ་འཇིག་པ་མེད་དོ།
en: Signlessness is not perishable, or very perishable.

source: །སྨོན་པ་མེད་པ་ལ་འཇིག་པའམ། རབ་ཏུ་འཇིག་པ་མེད་དོ།
en: Wishlessness is not perishable, or very perishable.

source: །མངོན་པར་འདུ་བྱ་བ་མེད་པ་ལ་འཇིག་པའམ། རབ་ཏུ་འཇིག་པ་མེད་དོ།
en: The unconditioned is not perishable, or very perishable.

source: །སྐྱེ་བ་མེད་པ་ལ་འཇིག་པའམ། རབ་ཏུ་འཇིག་པ་མེད་དོ།
en: Nonarising is not perishable, or very perishable.

source: །དངོས་པོ་མེད་པ་ལ་འཇིག་པའམ། རབ་ཏུ་འཇིག་པ་མེད་དོ།
en: Nonentities are not perishable, or very perishable.

source: །རང་བཞིན་མེད་པ་ལ་འཇིག་པའམ། རབ་ཏུ་འཇིག་པ་མེད་དོ།
en: The lack of inherent existence is not perishable, or very perishable.

source: །རབ་འབྱོར་དེ་ལྟར་དེ་བཞིན་གཤེགས་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འཇིག་རྟེན་སྟོན་པར་གསུངས་ཏེ།
en: Subhūti, it is in this way that the tathāgatas speak of the perfection of wisdom revealing the world. “

source: རབ་འབྱོར་སེམས་ཅན་ཚད་མེད་གྲངས་མེད་དཔག་ཏུ་མེད་པའི་སེམས་དང་སྤྱོད་པ་མཁྱེན་པ་དེ་དག་ཀྱང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཉིད་ལ་བརྟེན་ཅིང་རབ་ཏུ་མཁྱེན་ཏེ།
en: Subhūti, those who know the minds and conduct of immeasurable, countless, and inestimable beings do so dependent on this profound perfection of wisdom.

source: རབ་འབྱོར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་ནི་སེམས་ཅན་མེད་དོ།
en: Subhūti, in this profound perfection of wisdom there are no beings.

source: །སེམས་ཅན་དུ་གདགས་པ་མི་དམིགས་སོ།
en: Nothing designated as a being is apprehended.

source: །གཟུགས་མེད་དོ།
en: There are no physical forms.

source: །གཟུགས་སུ་གདགས་པ་མི་དམིགས་སོ།
en: Nothing designated as a physical form is apprehended.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་མེད་དོ།
en: There are no feelings, perceptions, formative predispositions, or consciousness.

source: །རྣམ་པར་ཤེས་པར་གདགས་པ་མི་དམིགས་སོ།
en: Nothing designated as consciousness [and so forth] is apprehended.

source: །མིག་མེད་དོ། །གཟུགས་མེད་དོ། །མིག་གི་རྣམ་པར་ཤེས་པ་མེད་དོ། །མིག་གི་འདུས་ཏེ་རེག་པ་མེད་དོ། །མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་མེད་དོ།
en: There are no eyes, there are no sights, there is no visual consciousness, there is no visually compounded sensory contact, and there are no feelings conditioned by visually compounded sensory contact.

source: །མིག་དུ་གདགས་པ་མི་དམིགས་སོ།
en: Nothing designated as the eyes is apprehended.

source: །མིག་གི་རྣམ་པར་ཤེས་པར་གདགས་པ་མི་དམིགས་སོ།
en: Nothing designated as visual consciousness is apprehended.

source: །མིག་གི་འདུས་ཏེ་རེག་པར་གདགས་པ་མི་དམིགས་སོ།
en: Nothing designated as visually compounded sensory contact is apprehended.

source: །མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བར་གདགས་པ་མི་དམིགས་སོ། །རྣ་བ་མེད་དོ། །སྐྲ་མེད་དོ། །སྣ་མེད་དོ། །དྲི་མེད་དོ།
en: Nothing designated as feelings conditioned by visually compounded sensory contact is apprehended.

source: །ལྕེ་མེད་དོ། །རོ་མེད་དོ། །ལུས་མེད་དོ། །རེག་བྱ་མེད་དོ། །ཡིད་མེད་དོ། །ཆོས་མེད་དོ།
en: There are no ears, there are no sounds, there is no nose, there are no odors, there is no tongue, there are no tastes, there is no body, there are no tangibles, there is no mental faculty, there are no mental phenomena, there is no mental consciousness [and so forth], there is no mentally compounded sensory contact [and so forth], and there are no feelings conditioned by mentally compounded sensory contact [and so forth].

source: །ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་མེད་དོ། །ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་མེད་དོ།
en: Nothing designated as mental consciousness [and so forth] is apprehended.

source: །ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་མེད་དོ། །ཡིད་དུ་གདགས་པ་མི་དམིགས་སོ། །ཆོས་སུ་གདགས་པ་མི་དམིགས་སོ།
en: Nothing designated as mentally compounded sensory contact [and so forth] is apprehended.

source: ཡིད་ཀྱི་རྣམ་པར་ཤེས་པར་གདགས་པ་མི་དམིགས་སོ། །ཡིད་ཀྱི་འདུས་ཏེ་རེག་པར་གདགས་པ་མི་དམིགས་སོ་ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བར་གདགས་པ་མི་དམིགས་སོ།
en: Nothing designated as feelings conditioned by mentally compounded sensory contact [and so forth] is apprehended. “

source: །རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་རྣམས་མེད་དོ།
en: There are no links of dependent origination.

source: །སྟོང་པ་ཉིད་ཐམས་ཅད་མེད་དོ།
en: There are no aspects of emptiness.

source: །རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་སྨོན་པ་མེད་པ་མེད་དོ།
en: There are no gateways of liberation—emptiness, signlessness, and wishlessness.

source: །དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་མེད་དོ།
en: There are no powers of the tathāgatas.

source: །མི་འཇིགས་པ་རྣམས་མེད་དོ།
en: There are no fearlessnesses.

source: །སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་མེད་དོ།
en: There are no kinds of exact knowledge. [

source: །སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་མེད་དོ།
en: There are no distinct qualities of the buddhas.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་མེད་དོ།
en: There are no [goals], up to and including all-aspect omniscience.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་གདགས་པ་མི་དམིགས་སོ།
en: Nothing designated as all-aspect omniscience [and so forth] is apprehended.

source: །རབ་འབྱོར་དེ་ལྟར་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ནི། དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་འཇིག་རྟེན་སྟོན་པ་ཡིན་ཏེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ནི་གཟུགས་སྟོན་པར་བྱེད་པ་མ་ཡིན་ནོ།
en: Subhūti, it is in this way that this profound perfection of wisdom reveals the world to the tathāgatas, That is to say, this profound perfection of wisdom does not reveal physical forms.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་། འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་སྟོན་པར་བྱེད་པ་མ་ཡིན་ནོ།
en: She does not reveal feelings, perceptions, formative predispositions, or consciousness.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་སྟོན་པར་བྱེད་པ་མ་ཡིན་ནོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཉིད་ཀྱང་།
en: She does not reveal [the other attributes and goals], up to and including all-aspect omniscience.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ཉིད་ལ་མེད་ཅིང་མི་དམིགས་ན། གཟུགས་དང་། ཚོར་བ་དང་། འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཡོད་པའམ། དམིགས་པར་ལྟ་ག་ལ་འགྱུར། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཡོད་པའམ། དམིགས་པར་ལྟ་ག་ལ་འགྱུར། རབ་འབྱོར་གཞན་ཡང་སེམས་ཅན་ཇི་སྙེད་ཅིག་གདགས་སུ་ཡོད་པ། གཟུགས་ཡོད་པའམ།
en: If you ask why, Subhūti, if even the perfection of wisdom itself does not exist and is not apprehended in the perfection of wisdom itself, how could physical forms, feelings, perceptions, formative predispositions, and consciousness exist and be apprehended? {

source: གཟུགས་མེད་པའམ། འདུ་ཤེས་ཡོད་པའམ། འདུ་ཤེས་མེད་པའམ། འདུ་ཤེས་ཡོད་པ་ཡང་མ་ཡིན། འདུ་ཤེས་མེད་པ་ཡང་མ་ཡིན་པ།
en: Ki.

source: འཇིག་རྟེན་གྱི་ཁམས་འདི་དང་། ཕྱོགས་བཅུ་ཀུན་གྱི་འཇིག་རྟེན་གྱི་ཁམས་དག་གི་ཡང་རུང་སྟེ། དེ་དག་གི་སེམས་བསྡུས་པ་དང་། སྤྲོས་པ་དེ་དག་ཀྱང་དེ་བཞིན་གཤེགས་པས་སེམས་བསྡུས་པ་དང་། སྤྲོས་པར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ།
en: IV: 60} “Moreover, Subhūti, the tathāgatas correctly and definitively know the collected and diffused thoughts of all those who are designated as beings, be they with or without physical form, with or without perception, or with neither perception nor nonperception, in this world system and in the world systems of all the ten directions.

source: །རབ་འབྱོར་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་སེམས་ཅན་དེ་དག་གི་སེམས་བསྡུས་པ་དང་། སྤྲོས་པ་ཡང་དག་པར་ཅི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཅེ་ན། རབ་འབྱོར་དེ་བཞིན་གཤེགས་པས་སེམས་ཅན་དེ་དག་གི་སེམས་བསྡུས་པ་དང་། སྤྲོས་པ་ནི་ཆོས་ཉིད་ཀྱིས་ཡང་དག་པར་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ། །གསོལ་པ།
en: Subhūti, if you ask how the tathāgatas correctly and definitively know the collected and diffused thoughts of those beings, it is the case, Subhūti, that the tathāgatas correctly and definitively know the collected and diffused thoughts of those beings through reality itself.” “

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པས་སེམས་ཅན་དེ་དག་གི་སེམས་བསྡུས་པ་དང་། སྤྲོས་པ་ཆོས་ཉིད་གང་གིས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་པ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, through what reality do the tathāgatas correctly and definitively know the collected and diffused thoughts of those beings?” “

source: རབ་འབྱོར་དེ་ནི་ཆོས་ཉིད་གང་ལ་ཆོས་ཉིད་ཀྱང་མི་དམིགས་ན། སེམས་བསྡུས་པ་དང་། སྤྲོས་པ་ལྟ་སྨོས་ཀྱང་མི་སྨོས་པའི་ཆོས་ཉིད་དེས། དེ་བཞིན་གཤེགས་པས་སེམས་ཅན་དེ་དག་གི་སེམས་བསྡུས་པ་དང་། སྤྲོས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ།
en: Subhūti,” replied the Blessed One, “the tathāgatas correctly and definitively know the collected and diffused thoughts of those beings through that reality in which even reality itself is not apprehended, let alone the collected and diffused thoughts [of beings]! “

source: །རབ་འབྱོར་གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས། སེམས་ཅན་དེ་དག་གི་སེམས་བསྡུས་པ་དང་། སྤྲོས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏེ། རབ་འབྱོར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས། སེམས་ཅན་དེ་དག་གི་སེམས་བསྡུས་པ་དང་།
en: Moreover, Subhūti, the tathāgatas, arhats, completely awakened buddhas correctly and definitively know the collected and diffused thoughts of those beings.
